package softeer.lv1.메리크리스마스;

import java.io.*;
import java.util.*;

public class Main {
    public static void main(String[] args) {
        String answer = 
            "##  ##     ##     #####    #####    ##  ##            ##  ##            ##   ##    ##      ####\n" +
            "##  ##    ####    ##  ##   ##  ##   ##  ##            ##  ##            ### ###   ####    ##  ##\n" +
            "##  ##   ##  ##   ##  ##   ##  ##   ##  ##             ####             #######  ##  ##   ##\n" +
            "######   ######   #####    #####     ####               ##     ######   ## # ##  ######    ####\n" +
            "##  ##   ##  ##   ##       ##         ##               ####             ##   ##  ##  ##       ##\n" +
            "##  ##   ##  ##   ##       ##         ##              ##  ##            ##   ##  ##  ##   ##  ##\n" +
            "##  ##   ##  ##   ##       ##         ##              ##  ##            ##   ##  ##  ##    ####";

        System.out.println(answer);
    }
}